let admin;
let name;
name = "Джон";
admin = name;
alert(admin);

// ----------------------------------------------

let planetName;
let currenUser;

// ----------------------------------------------

/* 
birthday - может быть в верхнем регистре, т.к. имеет заранее известное фиксированное значение.
age - не должна быть в верхнем регистре, т.к. она высчитывается
*/


// ----------------------------------------------


/*
hello 1
hello name
hello Ilya
*/


// ----------------------------------------------


/*
"" + 1 + 0 = 10
"" - 1 + 0 = -1
true + false = 1
6 / "3" = 2
"2" * "3" = 6
4 + 5 + "px" = 9px
"$" + 4 + 5 = $45
"4" - 2 = 2
"4px" - 2 = NaN
7 / 0 = бесконечность
"  -9  " + 5 =   -9  5
"  -9  " - 5 = -14
null + 1 = 1
undefined + 1 = NaN
" \t \n" - 2 = -2
*/


// ----------------------------------------------


a = 2;
b = 2;
c = 2;
d = 1;

a = 4;
x = 5;


// ----------------------------------------------


5 > 4 //true
"ананас" > "яблоко" // false
"2" > "12" // true
undefined == null // true
undefined === null // false
null == "\n0\n" // false
null === +"\n0\n" // false


// ----------------------------------------------

/*
да, строка - это true

let answer = prompt('Какое «официальное» название JavaScript?');
if (answer === 'ECMAScript') {
    alert('Верно!');
} else {
    alert('Не знаете? ECMAScript!');
}

let number = prompt('Введите число?');
if (number > '0') {
    alert(1);
} else if (number < '0') {
    alert(-1);
} else {
    alert(0);
}

let result = (a + b < 4) ? "Мало" : "Много";

let message = (login == 'Сотрудник') ? 'Привет' :
    (login == 'Директор') ? 'Здравствуйте' :
    (login == '') ? 'Нет логина' :
    '';

*/


// ----------------------------------------------

/*

1, потому что цикл остановится на 0, а понижение i-- происходит после вывода i

-

от 0 до 4 и там и там. 

let i = 2;
for (i >= 2; i <=10; i++) {
    if (i%0 === 0) {
        alert(i);
    }
}

оставляю на завтра, че эта часть тем мне дается очень с трудом.

*/


// ----------------------------------------------


